IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dac_regs.xml
<module id="DAC_REGS" HW_revision="" description="DAC Registers">
	<register id="DACREV" width="16" page="1" offset="0x0" internal="0" description="DAC Revision Register">
		<bitfield id="REV" description="DAC Revision Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DACCTL" width="16" page="1" offset="0x1" internal="0" description="DAC Control Register">
		<bitfield id="DACREFSEL" description="DAC Reference Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOADMODE" description="DACVALA Load Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYNCSEL" description="DAC EPWMSYNCPER Select" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="DACVALA" width="16" page="1" offset="0x2" internal="0" description="DAC Value Register - Active">
		<bitfield id="DACVALA" description="DAC Active Output Code" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="DACVALS" width="16" page="1" offset="0x3" internal="0" description="DAC Value Register - Shadow">
		<bitfield id="DACVALS" description="DAC Shadow Output Code" begin="11" end="0" width="12" rwaccess="RW"/>
	</register>
	<register id="DACOUTEN" width="16" page="1" offset="0x4" internal="0" description="DAC Output Enable Register">
		<bitfield id="DACOUTEN" description="DAC Output Code" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DACLOCK" width="16" page="1" offset="0x5" internal="0" description="DAC Lock Register">
		<bitfield id="DACCTL" description="DAC Control Register Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DACVAL" description="DAC Value Register Lock" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DACOUTEN" description="DAC Output Enable Register Lock" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="DAC Register Lock Key " begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DACTRIM" width="16" page="1" offset="0x6" internal="0" description="DAC Trim Register">
		<bitfield id="OFFSET_TRIM" description="DAC Offset Trim" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
</module>
